* 데이터 로드를 위해 다음의 셀을 실행해 주세요.

In [1]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## 1. 행과 열의 갯수를 출력해 주세요.

`(891, 15)` 라는 결과가 출력되도록 합니다.

In [2]:
df.shape

(891, 15)

## 2. 결측치의 수를 세어주세요.
* 아래의 결과가 출력되도록 합니다.
```
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
```

In [3]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

## 3. alive 컬럼의 빈도수를 구해주세요.
* 다음의 결과가 출력되도록 합니다.
```
no     549
yes    342
Name: alive, dtype: int64
```

In [4]:
df["alive"].value_counts()

no     549
yes    342
Name: alive, dtype: int64

## 4. age 컬럼의 기술통계 값을 구합니다.
* 다음의 결과가 출력되도록 합니다.
```
count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64
```

In [5]:
df["age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

## 5. object 타입의 기술통계 값을 구합니다.
* 모든 컬럼 중 object 타입인 컬럼만 요약합니다.
* 요약 결과에 count, unique, top, freq 가 출력됩니다.

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>sex</th>
      <th>embarked</th>
      <th>who</th>
      <th>embark_town</th>
      <th>alive</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>891</td>
      <td>889</td>
      <td>891</td>
      <td>889</td>
      <td>891</td>
    </tr>
    <tr>
      <th>unique</th>
      <td>2</td>
      <td>3</td>
      <td>3</td>
      <td>3</td>
      <td>2</td>
    </tr>
    <tr>
      <th>top</th>
      <td>male</td>
      <td>S</td>
      <td>man</td>
      <td>Southampton</td>
      <td>no</td>
    </tr>
    <tr>
      <th>freq</th>
      <td>577</td>
      <td>644</td>
      <td>537</td>
      <td>644</td>
      <td>549</td>
    </tr>
  </tbody>
</table>

In [6]:
df.describe(include="object")

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

## 6. embark_town 컬럼의 값을 소문자로 변경 후에 "embark_lower" 라는 새로운 컬럼에 담아주세요.
* 그리고 embark_lower 컬럼에 담긴 값을 일부만 가져와 출력해 주세요. 아래의 결과가 표시되도록 합니다.

```
0    southampton
1      cherbourg
2    southampton
3    southampton
4    southampton
Name: embark_lower, dtype: object
```

In [7]:
df["embark_lower"] = df["embark_town"].str.lower()

## 7. embark_lower 컬럼에서 south 가 들어가는 데이터의 수를 세어보세요.
* 6번 문제와 이어지는 문제입니다.
* True, False 로 출력되도록 하고 sum을 통해 값을 계산하면 644 가 출력됩니다.

In [8]:
df["embark_lower"].str.contains("south").sum()

644

## 8. age 컬럼의 값이 15 보다 작은 값을 구합니다.  True, False로 표시되는 값을 child 라는 새로운 컬럼에 담아주세요.
* child 라는 파생변수가 생성되도록 합니다.

In [9]:
df["child"] = (df["age"] < 15)

## 9. 위에서 만든 child 컬럼을 통해 child 의 값을 그룹화 해서 세어봅니다.
* 8번 문제와 이어지는 문제입니다.
* 다음의 값이 출력되도록 합니다.
```
False    813
True      78
Name: child, dtype: int64
```

In [10]:
df["child"].value_counts()

False    813
True      78
Name: child, dtype: int64

## 10. who 와 embark_town 의 빈도수를 구해주세요.
* 다음의 결과가 나오도록 합니다.
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>embark_town</th>
      <th>Cherbourg</th>
      <th>Queenstown</th>
      <th>Southampton</th>
    </tr>
    <tr>
      <th>who</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>child</th>
      <td>18</td>
      <td>5</td>
      <td>60</td>
    </tr>
    <tr>
      <th>man</th>
      <td>90</td>
      <td>37</td>
      <td>410</td>
    </tr>
    <tr>
      <th>woman</th>
      <td>60</td>
      <td>35</td>
      <td>174</td>
    </tr>
  </tbody>
</table>

In [11]:
pd.crosstab(df["who"],df["embark_town"])

embark_town  Cherbourg  Queenstown  Southampton
who
child               18           5           60
man                 90          37          410
woman               60          35          174